{
    "title": "Sperm Retrieval Procedures (TESE, TESA)",
    "description": "<p>Men who have male factor infertility will sometimes produce semen with no sperm, also known as azoospermia. But couples struggling with male factor infertility still have options. In the past, the only options for treating azoospermia were reconstructive surgery (if there was obstruction) or donor insemination. Now intra-cytoplasmic sperm injection (ICSI) has enabled many azoospermic men to become biological fathers using sperm obtained from their epididymis or testis. Two of the most common sperm retrieval procedures are Testicular Sperm Aspiration (TESA) and Testicular Sperm Extraction (TESE).</p> <p>Couples should understand the difference between TESA and TESE and discuss their best treatment options with their physician.</p>",
    "image": "/procedures/tese-tesa.jpg",
    "procedure": [
        "TESA is a procedure that can be performed in the clinic. In TESA, one or both of the testes are numbed, and then the physician uses a needle to aspirate sperm. This means that the physician obtains a small sample of tissue using gentle suction to examine under a microscope. If the tissue sample shows adequate amounts of sperm, the physician then takes another small tissue sample for sperm extraction.",
        "In TESE, the physician performs a surgical biopsy of the testis to retrieve tissue that contains sperm. Usually, this tissue has already been identified through mapping techniques and then, through a small incision, is extracted.",
        "Which is better? <b>TESE</b> or <b>TESA</b>",
        "<b>TESA</b> is most appropriate for men who have an adequate amount of sperm throughout the testicles.  Occasionally, TESA doesn’t provide enough tissue/sperm and an open testis biopsy is needed.",
        "<b>TESE</b> is one of the best ways to find sperm that a couple can use for ICSI or IVF procedures. The goals of TESE are to extract as much usable sperm as possible so that the couple have an adequate amount to fertilize an egg. TESE also minimizes any damage to reproductive organs and is usually done under local anesthesia to decrease pain or discomfort. TESE is sometimes done diagnostically to find out if a man has enough sperm. It may also be appropriate for men who are producing sperm, but are not candidates for other procedures because of scar tissue or prior surgeries.",
        "<b>How long it takes to recover after a sperm extraction?</b>",
        "After a man undergoes sperm extraction through TESA or TESE, he may feel some discomfort for a few days. Usually, he can resume non-vigorous activity after 2-3 days. There may be some swelling, bruising, or small amounts of fluid drainage for a few days. Following TESA or TESE procedures, men can take over-the-counter pain medications, and should emphasize rest and a healthy diet."
    ]
}